/*
 * @Description: 隐私条款 用于appstore链接
 * @Author: 尚夏
 * @Date: 2021-11-12 16:46:37
 * @LastEditTime: 2021-11-19 16:21:38
 * @FilePath: /bit-china/pages/PrivacyClause/index.tsx
 */

import React from "react";
import styles from "./PrivacyClause.module.scss";

function PrivacyClause({}) {
  return (
    <div className={styles.privacy}>
      <h2>隐私条款</h2>
      <div>
        我们尊重用户（统称为“您”）的隐私，并承诺尽力保护您的线上隐私。本隐私条款概述了CloudWorld及其关联实体（以下称为“CloudWorld”或“我们”）管理、收集、维护和处理用户个人数据的流程。
        我们可能不时更新本隐私政策。我们会在CloudWorld APP
        页面上发布新的隐私政策来通知您任何变更。我们建议您定期查看此隐私政策来了解变更。本隐私政策的变更自其发布之时生效。
      </div>
      <p>一、信息收集</p>
      <div>
        我们可能会使用您的个人数据来提供和改进CloudWorld向您提供的存储节点共享服务
        （“服务”），并改善您在CloudWorld APP
        上的使用体验。“个人数据”是指与被识别或可识别的人有关的任何信息。当您为使用服务创建帐户时，我们会收集您提供给我们的信息。我们还使用各种技术来收集和存储信息，包括
        Cookie、像素标签、本地存储（如浏览器网络存储或应用程序数据缓存、数据库和服务器日志）。
        您使用CloudWorld APP
        时，即表示您同意我们按照本隐私政策收集和使用信息。除非本隐私政策另有规定，否则本隐私政策中使用的术语与我们的服务协议具有相同的含义。
      </div>
      <p>1、注册</p>
      <div>
        创建账户时，需要您提供数据，包括您的电子邮箱，电话，密码或其他信息。如果您拒绝提供上述信息，我们将无法向您提供服务。
      </div>
      <p>2、日志信息 CloudWorld会在您访问我们的网站、APP</p>
      <div>
        和登录您的帐户时收集您的浏览器发送的信息（“日志数据”）。此日志数据可能包括以下信息：您的计算机的互联网协议
        （“IP”）地址、浏览器类型、浏览器版本、您访问的服务的页面、访问时间和日期、在这些页面上花费的时间和其他统计数据。此外，我们可能会使用
        Google Analytics
        等第三方服务来收集、监控和分析此类信息，以提升我们服务的功能性。
        这些第三方服务提供商有自己的隐私政策来说明他们如何使用此类信息。这些第三方服务提供商只能在代表我们执行任务所需时查看使用您的个人数据。
      </div>
      <p>
        3、我们如何使用您的信息 我们可能会使用您提供的个人信息用于下列目的：
      </p>
      <div>（1）向您展示我们的网站及其内容;</div>
      <div>（2）将您识别为我们系统中的用户;</div>
      <div>（3）处理您的订单; </div>
      <div>（4）提供客户服务;</div>
      <div>（5）回应您的要求; </div>
      <div>（6）为您提供产品更新;</div>
      <div>（7）改善我们的CloudWorld APP; </div>
      <div>（8）发送与我们产品相关的新闻通讯，调查，优惠和其他宣传材料; </div>
      <div>（9）与您沟通;</div>
      <div>
        （10） 管理风险并保护本 APP 及网站，完善我们的服务和使您免受欺诈;
      </div>
      <div>（11）遵守所有适用的法律和法规，并执行CloudWorld服务协议;</div>
      <div>（12）其他征得您同意的目的。</div>
      <p>
        二、第三方服务提供商 我们可能会聘请第三方公司为CloudWorld
        APP提供业务相关服务。这些第三方只能在为我们提供服务的期间访问您的个人数据，并且有义务不得透露或将其用于任何其他目的。
      </p>
      <p>三、如果您是欧洲经济区（EEA）的居民</p>
      <div>
        如果您是欧洲经济区（EEA）的居民，根据适用法律法规您拥有一些特定的数据保护权利。我们的目标是采取合理的措施，允许您更正，修改，删除或限制您的个人数据的使用。如果您希望了解我们持有的关于您的个人数据以及您希望将您的个人信息从我们的系统中删除，请与我们联系。
      </div>
      <p> 四、信息安全 </p>
      <div>
        {" "}
        虽然我们致力于保护我们的CloudWorld网络 APP
        和服务，但您有责任保护和维护您的个人信息安全，并验证我们维护的有关您的个人信息是否准确和最新。您必须防止未经授权访问您的帐户。且不要向未经授权的人员披露您的帐户密码和任何其他帐户注册信息。
        然而，没有一个通过因特网传输的方法或电子存储方法是 100％安全的。因此，
        在我们尽力保护您的个人信息的同时，我们无法保证其绝对的安全性。我们无法保证您传输到我们
        APP
        和或通过我们的服务的个人信息的安全性。任何个人信息的传输均由您自行承担风险。
      </div>
      <p>五、国际数据传输</p>
      <div>
        通过提交您的信息，您同意您的信息（包括个人数据）可能会传输和保存到您所在国家/地区管辖范围之外的计算机和系统。若发生该等传输，我们会尽力确保您的信息得到和您所在国家/地区规定的程度基本一致的保护。
      </div>
      <p>六、第三方链接</p>
      <div>
        我们的服务可能包含链接指向非我们运营的第三方网站。如果您点击第三方链接，
        您将被引导至该第三方网站。本隐私政策不适用于其他第三方网站。我们强烈建
        议您查看所访问的网站的隐私政策。CloudWorld网络无法管控任何第三方网站或服务的
        内容和隐私政策，也不承担任何责任。
      </div>
      <p>七、儿童隐私</p>
      <div>
        我们不会故意从 13 岁以下的人士收集或维护我们网站上的个人数据，并且我们
        网站的任何部分都不会针对 13 岁以下的人士。如果您未满 13
        岁，请不要以任何方式使用或访问CloudWorld APP。
        当我们得知我们无意中收集了 13
        岁以下的人士的个人数据时，我们会根据适用法律法规进行删除或采取其他合适的措施。
      </div>
      <p>八、个人数据使用目的变更</p>
      <div>
        {" "}
        如果我们决定将您的个人数据用于本隐私政策声明以外的任何其他目的，我们将进行通知并为您提供一个有效的退出途径，供您选择不让自己的个人数据用于本隐私政策规定外的其他目的。
        我们可能会向您发送有关新服务和新活动的电子邮件。您可以在我们发送的每封电子邮件中选择“取消订阅”功能来拒绝接收CloudWorld的宣传性电子邮件。但是，
        您同意使用服务的用户应继续接收与服务相关的其他重要电子邮件。
      </div>
      <p>九、信息保存时间</p>
      <div>
        除非适用法律法规有存留要求，我们只会在达成本政策所述目的所需的期限内保留和存储您的个人信息。在法律允许的情况下，我们可能会存储一定的个人信息用于备案或通过法律途径保障自身的权益。
      </div>
      <p>十、如何了解，获取，更改或删除您的个人信息</p>
      <div>
        如果您想确认我们正在处理您的数据，访问我们可能拥有的有关您的个人数据，
        更正我们收集的您的个人信息，或删除我们收集的您的个人信息，您可以使用本隐私政策规定的联系方式与我们联系。
        对我们而言，确保我们收集的有关您的个人信息的准确性，完整性和最新性非常重要。如果您发现您的信息不准确或已过时，请告知我们，我们会进行相应的更改。但是，如果我们认为更改会违反任何法律或法律要求，或导致信息不正确，
        我们可能无法接受更改信息的请求。 十一、法律适用及管辖
        本政策适用中华人民共和国法律。我们官方认可的服务接受地法律另有规定的，
        参照执行。
        因本政策产生的任何纠纷或争议，首先应该友好协商解决；协商不成时，任何一方均可向杭州市西湖区有管辖权的人民法院提起诉讼。
      </div>
      <p>十二、如何联系我们</p>
      <div>
        如果您对本隐私政策有任何疑问，请发送电子邮件与我们联系。我已阅读并同意上述条款
      </div>
    </div>
  );
}

export default PrivacyClause;
